FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
static atlas_err_t joint_manager_event_stop_handler(
    joint_manager_t* manager,
    joint_event_payload_stop_t const* payload)
{
    ATLAS_ASSERT(manager && payload);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    motor_driver_set_speed(&manager->driver,
                           0.0F,
                           manager->reference.delta_time);

    manager->is_running = false;

#ifdef DELTA_TEST
    manager->reference.delta_time = 0.01F;
    manager->reference.position = 100.0F;
    xTimerStop(timer_manager_get(TIMER_TYPE_DELTA_TEST), pdMS_TO_TICKS(1));
#endif

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_reference_handler(
    joint_manager_t* manager,
    joint_event_payload_reference_t const* reference)
{
    ATLAS_ASSERT(manager && reference);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    manager->reference = reference->reference;

    atlas_joint_reference_print(&manager->reference);

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_handler(joint_manager_t* manager,
                                               joint_event_t const* event)
{
    ATLAS_ASSERT(manager && event);

    switch (event->type) {
        case JOINT_EVENT_TYPE_START: {
            return joint_manager_event_start_handler(manager,
                                                     &event->payload.start);
        }
        case JOINT_EVENT_TYPE_STOP: {
            return joint_manager_event_stop_handler(manager,
                                                    &event->payload.stop);
        }
        case JOINT_EVENT_TYPE_REFERENCE: {
            return joint_manager_event_reference_handler(
                manager,
                &event->payload.reference);
        }
        default: {
            return ATLAS_ERR_UNKNOWN_EVENT;
        }
    }
}

atlas_err_t joint_manager_process(joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);

    joint_notify_t notify;
    if (joint_manager_receive_joint_notify(&notify)) {
        ATLAS_LOG_ON_ERR(TAG, joint_manager_notify_handler(manager, notify));
    }

    joint_event_t event;
    while (joint_manager_has_joint_event()) {
        if (joint_manager_receive_joint_event(&event)) {
            ATLAS_LOG_ON_ERR(TAG, joint_manager_event_handler(manager, &event));
        }
    }

    return ATLAS_ERR_OK;
}

atlas_err_t joint_manager_initialize(joint_manager_t* manager,
                                     joint_config_t const* config,
                                     joint_parameters_t const* parameters)
{
    ATLAS_ASSERT(manager && config && parameters);

    manager->config = *config;
    manager->is_running = false;
    manager->has_fault = false;
    manager->measure.current = 0.0F;
    manager->measure.position = 0.0F;
    manager->reference.position = 0.0F;
    manager->reference.delta_time = 0.0F;

    if (as5600_initialize(
            &manager->as5600,
            &(as5600_config_t){.max_angle = parameters->max_position,
                               .min_angle = parameters->min_position},
            &(as5600_interface_t){.gpio_user = &manager->config,
                                  .gpio_initialize = as5600_gpio_initialize,
                                  .gpio_deinitialize = as5600_gpio_deinitialize,
                                  .gpio_write_pin = as5600_gpio_write_pin,
                                  .adc_user = &manager->config,
                                  .adc_initialize = as5600_adc_initialize,
                                  .adc_deinitialize = as5600_adc_deinitialize,
                                  .bus_user = &manager->config,
                                  .bus_initialize = as5600_bus_initialize,
                                  .bus_deinitialize = as5600_bus_deinitialize,
                                  .bus_read_data = as5600_bus_read_data,
                                  .bus_write_data = as5600_bus_write_data}) !=
        AS5600_ERR_OK) {
        ATLAS_LOG(TAG, "Failed as5600_initialize");

        return ATLAS_ERR_FAIL;
    }

    if (as5600_initialize_chip(&manager->as5600,
                               parameters->min_position,
                               parameters->max_position,
                               parameters->magnet_polarity) != AS5600_ERR_OK) {
        ATLAS_LOG(TAG, "Failed as5600_initialize_chip");

        return ATLAS_ERR_FAIL;
    }

    if (drv8825_initialize(
            &manager->drv8825,
            &(drv8825_config_t){},
            &(drv8825_interface_t){
                .gpio_user = &manager->config,
                .gpio_initialize = drv8825_gpio_initialize,
                .gpio_deinitialize = drv8825_gpio_deinitialize,
                .gpio_write_pin = drv8825_gpio_write_pin,
                .pwm_user = &manager->config,
                .pwm_initialize = drv8825_pwm_initialize,
                .pwm_deinitialize = drv8825_pwm_deinitialize,
                .pwm_start = drv8825_pwm_start,
                .pwm_stop = drv8825_pwm_stop,
                .pwm_set_frequency = drv8825_pwm_set_frequency}) !=
        DRV8825_ERR_OK) {
        ATLAS_LOG(TAG, "Failed drv8825_initialize");

        return ATLAS_ERR_FAIL;
    }

    if (step_motor_initialize(
            &manager->motor,
            &(step_motor_config_t){.min_position = parameters->min_position,
                                   .max_position = parameters->max_position,
                                   .min_speed = parameters->min_speed,
                                   .max_speed = parameters->max_speed,
                                   .step_change = parameters->step_change},
            &(step_motor_interface_t){
                .device_user = manager,
                .device_initialize = step_motor_device_initialize,
                .device_deinitialize = step_motor_device_deinitialize,
                .device_set_frequency = step_motor_device_set_frequency,
                .device_set_direction = step_motor_device_set_direction},
            0.0F) != STEP_MOTOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed step_motor_initialize");

        return ATLAS_ERR_FAIL;
    }

    if (pid_regulator_initialize(
            &manager->regulator,
            &(pid_regulator_config_t){.prop_gain = parameters->prop_gain,
                                      .int_gain = parameters->int_gain,
                                      .dot_gain = parameters->dot_gain,
                                      .sat_gain = parameters->sat_gain,
                                      .min_control = parameters->min_speed,
                                      .max_control = parameters->max_speed,
                                      .dead_error = parameters->dead_error}) !=
        PID_REGULATOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed pid_regulator_initialize");

        return ATLAS_ERR_FAIL;
    }

    if (motor_driver_initialize(
            &manager->driver,
            &(motor_driver_config_t){
                .min_position = parameters->min_position,
                .max_position = parameters->max_position,
                .min_speed = parameters->min_speed,
                .max_speed = parameters->max_speed,
                .min_acceleration = parameters->min_acceleration,
                .max_acceleration = parameters->max_acceleration,
                .max_current = parameters->current_limit},
            &(motor_driver_interface_t){
                .motor_user = manager,
                .motor_initialize = motor_driver_motor_initialize,
                .motor_deinitialize = motor_driver_motor_deinitialize,
                .motor_set_speed = motor_driver_motor_set_speed,
                .encoder_user = manager,
                .encoder_initialize = motor_driver_encoder_initialize,
                .encoder_deinitialize = motor_driver_encoder_deinitialize,
                .encoder_get_position = motor_driver_encoder_get_position,
                .regulator_user = manager,
                .regulator_initialize = motor_driver_regulator_initialize,
                .regulator_deinitialize = motor_driver_regulator_deinitialize,
                .regulator_get_control = motor_driver_regulator_get_control,
                .fault_user = manager,
                .fault_initialize = motor_driver_fault_initialize,
                .fault_deinitialize = motor_driver_fault_deinitialize,
                .fault_get_current = motor_driver_fault_get_current}) !=
        MOTOR_DRIVER_ERR_OK) {
        ATLAS_LOG(TAG, "Failed motor_driver_initialize");

        return ATLAS_ERR_FAIL;
    }

    system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                            .type = SYSTEM_EVENT_TYPE_JOINT_STARTED,
                            .payload.joint_started = {}};
    if (!joint_manager_send_system_event(&event)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}
